ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_КлючиМоделей/АСМ_КлючиМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_КлючиМоделей</name>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БезМарки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезМаркиБезМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектации</name>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.АСМ_Комплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Совместимо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Модификации/АСМ_Модификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Модификации</name>
  <attributes>
    <name>ГодНачалаВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодОкончанияВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.АСМ_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоплива</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТоплива</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПривода</name>
    <type>
      <types>CatalogRef.АСМ_ТипыПривода</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТрансмиссии</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТрансмиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>CatalogRef.АСМ_Мощности</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийОбъем</name>
    <type>
      <types>CatalogRef.АСМ_Объемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.АСМ_ТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДверей</name>
    <type>
      <types>CatalogRef.АСМ_КоличествоДверей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектации</name>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.АСМ_Комплектации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Поколения/АСМ_Поколения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Поколения</name>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_КлючиМоделей/Forms/ФормаЭлемента/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НовыйОбъект = Параметры.Ключ.Пустая();

	Если НовыйОбъект Тогда

		ОпцииСоздания = Параметры.ПараметрыВыбора;

		Если ТипЗнч(ОпцииСоздания) = Тип("Структура") Тогда
			ОпцииСоздания.Свойство("Марка", Объект.Марка);
			ОпцииСоздания.Свойство("Модель", Объект.Модель);
		КонецЕсли;

	Иначе

		ОпцииОтбора = Справочники.АСМ_Модели.ОпцииОтбора(Объект.Модель);
		СписокПоколения.ЗагрузитьЗначения(ОпцииОтбора.Поколения.ВыгрузитьКолонку("Поколение"));

	КонецЕсли;

	Если Объект.Комплектации.Количество() > 0 Тогда

		ВыбранныеОпции = Справочники.АСМ_КлючиМоделей.ВыбранныеОпции(Объект.Ссылка);

		УстановитьПометкиСписка(ВыбранныеОпции.Поколения, СписокПоколения, "Поколение");
//		Для Каждого Эл Из ВыбранныеОпции.Поколения Цикл
//			НайденЭлемент = СписокПоколения.НайтиПоЗначению(Эл.Поколение);
//			Если НайденЭлемент <> Неопределено Тогда
//				НайденЭлемент.Пометка = Истина;
//			КонецЕсли;
//		КонецЦикла;

		ОбновитьСпискиПоПоколению(Ложь);

		УстановитьПометкиСписка(ВыбранныеОпции.ТипыКузовов, СписокКузова, "Расшифровка");
		УстановитьПометкиСписка(ВыбранныеОпции.Комплектации, СписокКомплектации, "Наименование");
		УстановитьПометкиСписка(ВыбранныеОпции.Агрегаты, СписокАгрегаты, "Расшифровка");

	ИначеЕсли ЗначениеЗаполнено(Объект.Марка) И ЗначениеЗаполнено(Объект.Модель) Тогда

		Поколения = МодельПриИзмененииНаСервере(Объект.Модель);
		СписокПоколения.ЗагрузитьЗначения(Поколения);
		ОбновитьСпискиПоПоколению(Ложь);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.Комплектации.Очистить();
	НаборКодов = Новый Массив;

	СписокКузоваВыбрано = ВыбранныеВСписке(СписокКузова);
	СписокКомплектацииВыбрано = ВыбранныеВСписке(СписокКомплектации);
	СписокПоколенияВыбрано = ВыбранныеВСписке(СписокПоколения);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Марка", ТекущийОбъект.Марка);
	Запрос.УстановитьПараметр("Модель", ТекущийОбъект.Модель);
	Запрос.УстановитьПараметр("Комплектации", СписокКомплектацииВыбрано);
	Запрос.УстановитьПараметр("ТипКузова", СписокКузоваВыбрано);
	Запрос.УстановитьПараметр("Поколения", СписокПоколенияВыбрано);

	Запрос.Текст = "ВЫБРАТЬ
				   |	АСМ_МодификацииКомплектации.Комплектация КАК Комплектация,
				   |	АСМ_МодификацииКомплектации.Комплектация.Код КАК КомплектацияКод
				   |ИЗ
				   |	Справочник.АСМ_Модификации.Комплектации КАК АСМ_МодификацииКомплектации
				   |ГДЕ
				   |	АСМ_МодификацииКомплектации.Комплектация.Наименование В (&Комплектации)
				   |	И АСМ_МодификацииКомплектации.Ссылка.Марка = &Марка
				   |	И АСМ_МодификацииКомплектации.Ссылка.Модель = &Модель
				   |	И АСМ_МодификацииКомплектации.Ссылка.ТипТоплива = &ТипТоплива
				   |	И АСМ_МодификацииКомплектации.Ссылка.ТипПривода = &ТипПривода
				   |	И АСМ_МодификацииКомплектации.Ссылка.ТипТрансмиссии = &ТипТрансмиссии
				   |	И АСМ_МодификацииКомплектации.Ссылка.Мощность = &Мощность
				   |	И АСМ_МодификацииКомплектации.Ссылка.РабочийОбъем = &РабочийОбъем
				   |	И АСМ_МодификацииКомплектации.Ссылка.ТипКузова.Наименование + "" ("" +
				   |		АСМ_МодификацииКомплектации.Ссылка.КоличествоДверей.Наименование + "" дв.)"" В (&ТипКузова)
				   |	И АСМ_МодификацииКомплектации.Ссылка.Поколение В (&Поколения)";

	СтрокиТЗ = ТаблицаАгрегаты.НайтиСтроки(Новый Структура("Совместимо", Истина));

	Для Каждого Эл Из СтрокиТЗ Цикл

		Запрос.УстановитьПараметр("ТипТоплива", Эл.ТипТоплива);
		Запрос.УстановитьПараметр("ТипПривода", Эл.ТипПривода);
		Запрос.УстановитьПараметр("ТипТрансмиссии", Эл.ТипТрансмиссии);
		Запрос.УстановитьПараметр("Мощность", Эл.Мощность);
		Запрос.УстановитьПараметр("РабочийОбъем", Эл.РабочийОбъем);

		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТекущийОбъект.Комплектации.Добавить();
			НоваяСтрока.Комплектация = Выборка.Комплектация;
			НаборКодов.Добавить(Выборка.КомплектацияКод);
		КонецЦикла;

	КонецЦикла;

	ТекущийОбъект.Описание = СтрСоединить(НаборКодов, " ");
	
	// Формирование строки поколений
	ПоколенияСтрока = "";

	Для Каждого Пок Из СписокПоколенияВыбрано Цикл
		ПоколенияСтрока = ПоколенияСтрока + " " + Строка(Пок);
	КонецЦикла;

	// Установка реквизитов
	ТекущийОбъект.Наименование = Строка(ТекущийОбъект.Марка)
								 + " "
								 + Строка(ТекущийОбъект.Модель)
								 + " "
								 + ПоколенияСтрока;
	ТекущийОбъект.БезМарки = Строка(ТекущийОбъект.Модель) + " " + ПоколенияСтрока;
	ТекущийОбъект.БезМаркиБезМодели = ПоколенияСтрока;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МаркаПриИзменении(Элемент)
	ОчиститьЗависимыеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)

	ОчиститьЗависимыеТаблицы();

	Поколения = МодельПриИзмененииНаСервере(Объект.Модель);
	СписокПоколения.ЗагрузитьЗначения(Поколения);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПоколения

&НаКлиенте
Процедура СписокПоколенияПриИзменении(Элемент)
	ОбновитьСпискиПоПоколению();
	
	// Формирование наименования
	Наименование = Строка(Объект.Марка) + " " + Строка(Объект.Модель);
	Для Каждого Пок Из СписокПоколения Цикл
		Если Пок.Пометка Тогда
			Наименование = Наименование + " " + Строка(Пок);
		КонецЕсли;
	КонецЦикла;

	Объект.Наименование = Наименование;

КонецПроцедуры

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьПометкиСписка(Источник, Приемник, ИмяПоля)

	Для Каждого Эл Из Источник Цикл
		НайденЭлемент = Приемник.НайтиПоЗначению(Эл[ИмяПоля]);
		Если НайденЭлемент <> Неопределено Тогда
			НайденЭлемент.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыбранныеВСписке(Список)

	Результат = Новый Массив;

	Для Каждого Эл Из Список Цикл
		Если Эл.Пометка Тогда
			Результат.Добавить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ОчиститьЗависимыеТаблицы()
	СписокАгрегаты.Очистить();
	СписокКузова.Очистить();
	СписокКомплектации.Очистить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МодельПриИзмененииНаСервере(Модель)
	Поколения = Справочники.АСМ_Модели.Поколения(Модель);
	Возврат Поколения;
КонецФункции

&НаСервере
Процедура ОбновитьСпискиПоПоколению(Выбрано = Истина)

	Поколения = Новый Массив;

	Для Каждого Эл Из СписокПоколения Цикл
		Если Эл.Пометка Тогда
			Поколения.Добавить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;

	ОпцииОтбора = Справочники.АСМ_Поколения.ОпцииОтбора(Поколения);

	ТаблицаАгрегаты.Загрузить(ОпцииОтбора.Агрегаты);

	СписокКузова.Очистить();
	Для Каждого Эл Из ОпцииОтбора.ТипыКузовов Цикл
		СписокКузова.Добавить(Эл.Расшифровка, Эл.Расшифровка, Выбрано);
	КонецЦикла;

	СписокАгрегаты.Очистить();
	Для Каждого Эл Из ОпцииОтбора.Агрегаты Цикл
		СписокАгрегаты.Добавить(Эл.Расшифровка, Эл.Расшифровка, Выбрано);
	КонецЦикла;

	СписокКомплектации.Очистить();
	Для Каждого Эл Из ОпцииОтбора.Комплектации Цикл
		СписокКомплектации.Добавить(Эл.Наименование, Эл.Наименование, Выбрано);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокАгрегатыПометкаПриИзменении(Элемент)
	Индекс = Элементы.СписокАгрегаты.ТекущаяСтрока;
	ТекущееЗначение = Элементы.СписокАгрегаты.ТекущиеДанные.Значение;

	Нечто = ТаблицаАгрегаты.НайтиСтроки(Новый Структура("Расшифровка", ТекущееЗначение));

	Нечто[0].Совместимо = Не Нечто[0].Совместимо;

КонецПроцедуры
#КонецОбласти
